#### FabricationPart Members

---

|  |
| --- |
| FabricationPart Class   Methods   Properties   See Also |

The  FabricationPart  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AddPartCustomData | Add custom data type to the fabrication part. The new data gets the default value defined by the fabrication configuration. |
| Public method | AdjustEndLength | Adjusts the length for the specified connector. |
| Public method Static member | AlignPartByConnector | Align the part by its connector to a point and rotation in free space. |
| Public method Static member | AlignPartByConnectors | Moves fabrication part by one of its connectors and aligns it to another connector. |
| Public method Static member | AlignPartByConnectorToConnector | Align a part by its connector to another connector. This will replace the FabricationPart::AlignPartByConnectors method. |
| Public method Static member | AlignPartByInsertionPoint | Align the part by its insertion point to a point and rotation in free space. |
| Public method Static member | AlignPartByInsertionPointAndCutInToStraight | Align the part by its insertion point to a point and rotation on a straight. This will automatically size and connect the part being cut into, if possible. |
| Public method | ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element. (Inherited from  Element  .) |
| Public method | CanAdjustEndLength | Checks if the end of fabrication part can be adjusted. |
| Public method | CanASlopeBeApplied | This will test if a slope can be applied to the part and maintain connections with any connected parts. |
| Public method | CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from  Element  .) |
| Public method | CanBeLocked | Identifies if the element can be locked. (Inherited from  Element  .) |
| Public method | CanDeleteSubelement | Checks if given subelement can be removed from the element. (Inherited from  Element  .) |
| Public method | CanFlipPart | Validates if the fabrication part is one of the supported fabrication part types that can be flipped. |
| Public method | CanHaveTypeAssigned | Identifies if the element can have a type assigned. (Inherited from  Element  .) |
| Public method | CanSplitStraight | Validates if the straight can be split into two at the passed in point. |
| Public method | ChangeTypeId(ElementId) | Changes the type of the element. (Inherited from  Element  .) |
| Public method Static member | ConnectAndCouple | Makes a connection between the specified connectors and adds coupling if necessary. |
| Public method Static member | Create(Document, FabricationItemFile, ElementId) | Creates a fabrication part element from a fabrication item file. |
| Public method Static member | Create(Document, FabricationServiceButton, Int32, ElementId) | Creates a fabrication part element based on button. |
| Public method Static member | Create(Document, FabricationServiceButton, Double, Double, ElementId) | Creates a fabrication part element based on button and size. |
| Public method Static member | CreateHanger(Document, FabricationServiceButton, Int32, ElementId) | Creates a free placed hanger. |
| Public method Static member | CreateHanger(Document, FabricationServiceButton, ElementId, Connector, Double, Boolean) | Creates a hanger on the fabrication part. |
| Public method Static member | CreateHanger(Document, FabricationServiceButton, Int32, ElementId, Connector, Double, Boolean) | Creates a hanger on the fabrication part. |
| Public method | DeleteEntity | Deletes the existing entity created by %schema% in the element (Inherited from  Element  .) |
| Public method | DeleteSubelement | Removes a subelement from the element. (Inherited from  Element  .) |
| Public method | DeleteSubelements | Removes the subelements from the element. (Inherited from  Element  .) |
| Public method | Dispose | (Inherited from  Element  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | Flip | Flips the fabrication part that is directionally oriented (tees, crosses, valves, dampers, etc.) to the opposite direction. |
| Public method | GetCalculatedDimensionValue | Gets the calculated dimension value. |
| Public method | GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element. (Inherited from  Element  .) |
| Public method | GetDimensionCalculatedOptions | Gets the calculated options of the fabrication dimension. |
| Public method | GetDimensions | Gets all fabrication dimensions. |
| Public method | GetDimensionValue | Gets the value of the fabrication dimension, returns value in Revit internal units. |
| Public method | GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise. (Inherited from  Element  .) |
| Public method | GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element. (Inherited from  Element  .) |
| Public method | GetExternalFileReference | Gets information pertaining to the external file referenced by the element. (Inherited from  Element  .) |
| Public method | GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type. (Inherited from  Element  .) |
| Public method | GetExternalResourceReferenceExpanded | Gets the collection of ExternalResourceReference associated with a specified external resource type. (Inherited from  Element  .) |
| Public method | GetExternalResourceReferences | Gets the map of the external resource references referenced by the element. (Inherited from  Element  .) |
| Public method | GetExternalResourceReferencesExpanded | Gets the expanded map of the external resource references referenced by the element. (Inherited from  Element  .) |
| Public method | GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object. (Inherited from  Element  .) |
| Public method | GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference. (Inherited from  Element  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetHostedInfo | Gets the fabrication hosted element information. |
| Public method | GetInsulationLiningGeometry | Gets insulation and lining geometry for this fabrication part. |
| Public method | GetMaterialArea | Gets the area of the material with the given id. (Inherited from  Element  .) |
| Public method | GetMaterialIds | Gets the element ids of all materials present in the element. (Inherited from  Element  .) |
| Public method | GetMaterialVolume | Gets the volume of the material with the given id. (Inherited from  Element  .) |
| Public method | GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring. (Inherited from  Element  .) |
| Public method | GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring. (Inherited from  Element  .) |
| Public method | GetOrderedParameters | Gets the parameters associated to the element in order. (Inherited from  Element  .) |
| Public method | GetParameter | Retrieves a parameter from the element given identifier. (Inherited from  Element  .) |
| Public method | GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists. (Inherited from  Element  .) |
| Public method | GetParameters | Retrieves the parameters from the element via the given name. (Inherited from  Element  .) |
| Public method | GetPartAncillaryUsage | Gets a list of all ancillary usage information for the part. |
| Public method | GetPartCustomDataInteger | Get custom data integer value for the specified custom data. |
| Public method | GetPartCustomDataReal | Get custom data real value for the specified custom data. |
| Public method | GetPartCustomDataText | Get custom data text for the specified custom data. |
| Public method | GetPhaseStatus | Gets the status of a given element in the input phase (Inherited from  Element  .) |
| Public method | GetProductListEntryCount | Gets the number of product entries for this part. |
| Public method | GetProductListEntryName | Gets the specified product list entry name. |
| Public method | GetRodInfo | Gets the fabrication rod information. |
| Public method | GetSubelements | Returns the collection of element subelements. (Inherited from  Element  .) |
| Public method | GetTransform | Gets the transformation matrix of the fabrication part element. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetTypeId | Returns the identifier of this element's type. (Inherited from  Element  .) |
| Public method | GetValidTypes | Obtains a set of types that are valid for this element. (Inherited from  Element  .) |
| Public method | GetVersionHistory | Gets a history of version change information about the current part. |
| Public method | HasCustomData | Check if fabrication part contains custom data already. |
| Public method | HasNoConnections | Checks to see if all the fabrication part's connectors are open. |
| Public method | HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId. (Inherited from  Element  .) |
| Public method | IsAHanger | Checks whether it is a hanger. |
| Public method | IsAStraight | Checks whether it is a straight part. |
| Public method | IsATap | Checks if it is any sort of tap. |
| Public method | IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. (Inherited from  Element  .) |
| Public method | IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. (Inherited from  Element  .) |
| Public method | IsDimensionCalculated | Checks if the fabrication dimension is calculated. |
| Public method | IsExternalFileReference | Determines whether this Element represents an external file. (Inherited from  Element  .) |
| Public method | IsHidden | Identifies if the element has been permanently hidden in the view. (Inherited from  Element  .) |
| Public method | IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models. (Inherited from  Element  .) |
| Public method | IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements. (Inherited from  Element  .) |
| Public method | IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element. (Inherited from  Element  .) |
| Public method | IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element. (Inherited from  Element  .) |
| Public method | IsProductList | Gets whether or not the fabrication part is a product list. |
| Public method | IsProductListEntryCompatibleSize | Checks to see if this part can be changed to the specified product entry without altering any connected dimensions. |
| Public method | IsSameAs | Compare this fabrication part with the part passed and checks the pattern dimensions and options. A list of fields that can be ignored in the comparison check can be specified. |
| Public method | IsValidType(ElementId) | Checks if given type is valid for this element. (Inherited from  Element  .) |
| Public method | LookupParameter | Attempts to find a parameter on the element which has the given name. (Inherited from  Element  .) |
| Public method Static member | OptimizeLengths | Optimizes the length fabrication straight parts. |
| Public method Static member | PlaceAsTap | Places the part by its connector to a specific position on the straight part at the specified distance from the host part connector. |
| Public method Static member | PlaceFittingAsCutIn | Places the fitting on the straight part by cut in, use the fitting's focal point as the insertion position. |
| Public method | RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type. (Inherited from  Element  .) |
| Public method | RefersToExternalResourceReferences | Determines whether this Element uses external resources. (Inherited from  Element  .) |
| Public method | RemovePartCustomData | Remove custom data from the fabrication part. |
| Public method Static member | Reposition | Repositions the fabrication straight part to another end of the run. |
| Public method Static member | RotateConnectedPartByConnector | Rotates a connected fabrication part around the axis of the specified connector. |
| Public method Static member | RotateConnectedTap | Rotates a connected fabrication tap by the specified angles about the primary and secondary axis. |
| Public method Static member | SaveAsFabricationJob | Save fabrication parts to an MEP job that can be opened in the fabrication software. |
| Public method | SetCalculatedDimensionValue | Sets the calculated dimension value. |
| Public method | SetDimensionValue | Sets the fabrication dimension value. The value is in Revit internal units. |
| Public method | SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten. (Inherited from  Element  .) |
| Public method | SetPartCustomDataInteger | Set the custom data integer value for the specified custom data. |
| Public method | SetPartCustomDataReal | Set the custom data real value for the specified custom data. |
| Public method | SetPartCustomDataText | Set the custom data real value for the specified custom data. |
| Public method | SetPositionByEnd | Positions the connector of the fabrication part element by the passed point. |
| Public method | SplitStraight(XYZ) | Splits the straight into two at the passed in point. |
| Public method | SplitStraight(Document, ElementId, XYZ) | Splits the straight into two at the passed in point. |
| Public method Static member | StretchAndFit | Stretch the fabrication part from the specified connector and fit to the target routing end. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Alias | The alias of the fabrication part. |
| Public property | AssemblyInstanceId | The id of the assembly instance to which the element belongs. (Inherited from  Element  .) |
| Public property | BottomOfPartElevation | The associated elevation to the bottom of fabrication part off of the current level. |
| Public property | BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from  Element  .) |
| Public property | Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from  Element  .) |
| Public property | CenterlineLength | The centerline length of the fabrication part. |
| Public property | ConnectorManager | The connector manager of the fabrication part. |
| Public property | CreatedPhaseId | Id of a Phase at which the Element was created. (Inherited from  Element  .) |
| Public property | CutType | The cut type of the fabrication part. |
| Public property | DemolishedPhaseId | Id of a Phase at which the Element was demolished. (Inherited from  Element  .) |
| Public property | DesignOption | Returns the design option to which the element belongs. (Inherited from  Element  .) |
| Public property | Document | Returns the Document in which the Element resides. (Inherited from  Element  .) |
| Public property | DomainType | The domain type for the fabrication part. |
| Public property | DoubleWallMaterial | The double wall material identifier of the fabrication part. |
| Public property | DoubleWallMaterialArea | The double wall material area of the fabrication part. If the fabrication part is not double walled, returns zero. |
| Public property | DoubleWallMaterialThickness | The double wall material thickness of the fabrication part. If the fabrication part is not double walled, returns zero. |
| Public property | FreeSize | The inner size of the fabrication part. |
| Public property | Geometry | Retrieves the geometric representation of the element. (Inherited from  Element  .) |
| Public property | GeometryChecksum | Gets the geometry checksum of the fabrication part symbol, and it does nothing with the fabrication part instance position. |
| Public property | GroupId | The id of the group to which an element belongs. (Inherited from  Element  .) |
| Public property | HangerRodKit | Specifies whether an ancillary kit is being used to override support rods, bolts and clips, if any. A value of 0 indicates no override is being used. |
| Public property | HasDoubleWall | True if the fabrication part is double walled. |
| Public property | HasInsulation | True if the fabrication part is insulated. |
| Public property | HasLining | True if the fabrication part is lined. |
| Public property | Id | A unique identifier for an Element in an Autodesk Revit project. (Inherited from  Element  .) |
| Public property | InsulationArea | The insulation area of the fabrication part. If the fabrication part is not insulated, returns zero. |
| Public property | InsulationSpecification | The fabrication part insulation specification identifier. |
| Public property | InsulationThickness | The insulation thickness of the fabrication part. If the fabrication part is not insulated, returns zero. |
| Public property | InsulationType | The insulation type of the fabrication part. |
| Public property | IsBoughtOut | True if the fabrication part is bought out. |
| Public property | IsModifiable | Identifies if the element is modifiable. (Inherited from  Element  .) |
| Public property | IsTransient | Indicates whether an element is transient or permanent. (Inherited from  Element  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Element  .) |
| Public property | ItemCustomId | The item custom identifier for the fabrication part. |
| Public property | ItemNumber | The item number that is used for identification, re-ordering from shop. |
| Public property | LevelId | The id of the level associated with the element. (Inherited from  Element  .) |
| Public property | LevelOffset | The associated level offset that indicates the distance from the center of the fabrication part to the current level. |
| Public property | LiningArea | The lining area of the fabrication part. If the fabrication part is not lined, returns zero. |
| Public property | LiningThickness | The lining thickness of the fabrication part. If the fabrication part is not lined, returns zero. |
| Public property | LiningType | The lining type of the fabrication part. |
| Public property | Location | This property is used to find the physical location of an element within a project. (Inherited from  Element  .) |
| Public property | Material | The fabrication material identifier. |
| Public property | MaterialThickness | The material thickness of the fabrication part. |
| Public property | Name | A human readable name for the Element. (Inherited from  Element  .) |
| Public property | Notes | The notes of the fabrication part. |
| Public property | Origin | The origin of the fabrication part element. |
| Public property | OverallSize | The overall size of the fabrication part. |
| Public property | OwnerViewId | The id of the view that owns the element. (Inherited from  Element  .) |
| Public property | Parameter Guid | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from  Element  .) |
| Public property | Parameter BuiltInParameter | Retrieves a parameter from the element given a parameter id. (Inherited from  Element  .) |
| Public property | Parameter Definition | Retrieves a parameter from the element based on its definition. (Inherited from  Element  .) |
| Public property | Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from  Element  .) |
| Public property | ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from  Element  .) |
| Public property | PartGuid | The fabrication part's globally unique identifier. |
| Public property | PartStatus | The status identifier for the fabrication part. |
| Public property | Pinned | Identifies if the element has been pinned to prevent changes. (Inherited from  Element  .) |
| Public property | ProductCode | The current database id of the part within the fabrication database. |
| Public property | ProductDataRange | The product data range of the fabrication part. |
| Public property | ProductFinishDescription | The product finish description of the fabrication part. |
| Public property | ProductInstallType | The product install type of the fabrication part. |
| Public property | ProductListEntry | The product entry index of the fabrication part. A value of -1 indicates the fabrication part is not a product list. |
| Public property | ProductLongDescription | The product long description of the fabrication part. |
| Public property | ProductMaterialDescription | The product material description of the fabrication part. |
| Public property | ProductName | The product name of the fabrication part. |
| Public property | ProductOriginalEquipmentManufacture | The product original equipment manufacture (OEM) of the fabrication part. |
| Public property | ProductShortDescription | The product short description of the fabrication part. |
| Public property | ProductSizeDescription | The product size description of the fabrication part. |
| Public property | ProductSpecificationDescription | The product specification description of the fabrication part. |
| Public property | ServiceAbbreviation | The associated service abbreviation for the fabrication service. |
| Public property | ServiceId | The fabrication part service identifier. The service can only be changed to compatible services. |
| Public property | ServiceName | The name of the service associated with the fabrication part. |
| Public property | ServiceType | The service type identifier of the fabrication part. |
| Public property | SheetMetalArea | The sheet metal area of the fabrication part. |
| Public property | Size | The size of the fabrication part. |
| Public property | Slope | The slope for the straight fabrication part. |
| Public property | Specification | The fabrication part specification identifier. |
| Public property | SpoolName | The spool name of the fabrication part. |
| Public property | TopOfPartElevation | The associated elevation to the top of fabrication part off of the current level. |
| Public property | UniqueId | A stable unique identifier for an element within the document. (Inherited from  Element  .) |
| Public property | ValidationStatus | The validation status of the fabrication part. |
| Public property | Vendor | The vendor of the fabrication part. |
| Public property | VendorCode | The vendor code of the fabrication part. |
| Public property | VersionGuid | Get the element version Guid. (Inherited from  Element  .) |
| Public property | ViewSpecific | Identifies if the element is owned by a view. (Inherited from  Element  .) |
| Public property | Weight | The weight of the fabrication part. |
| Public property | WorksetId | Get Id of the Workset which owns the element. (Inherited from  Element  .) |

# See Also

FabricationPart Class

Autodesk.Revit.DB Namespace